testing/swift-mutations/patches/reintroduced-character-mask.patch
diff --git a/Sources/FloodlightEngine/Search/ApplicationCatalog.swift b/Sources/FloodlightEngine/Search/ApplicationCatalog.swift
index 851f64e..5191665 100644
--- a/Sources/FloodlightEngine/Search/ApplicationCatalog.swift
+++ b/Sources/FloodlightEngine/Search/ApplicationCatalog.swift
@@ -9,6 +9,7 @@ package final class ApplicationCatalog: Catalog {
         let subtitle: String
         let normalizedName: String
         let asciiCandidate: [UInt8]?
+        let characterMask: UInt64
     }
 
     private struct State: Sendable {
@@ -142,6 +143,10 @@ package final class ApplicationCatalog: Catalog {
         normalizedQuery: String,
         asciiQuery: [UInt8]?
     ) -> Int? {
+        let queryCharacterMask = FuzzyMatcher.characterMask(normalizedQuery)
+        guard application.characterMask & queryCharacterMask == queryCharacterMask else {
+            return nil
+        }
         let rawScore: Int? = if let asciiQuery, let asciiCandidate = application.asciiCandidate {
             FuzzyMatcher.scoreASCII(
                 normalizedQuery: asciiQuery,
@@ -332,13 +337,15 @@ package final class ApplicationCatalog: Catalog {
             let normalized = FuzzyMatcher.normalized(application.name)
             let utf8Bytes = Array(normalized.utf8)
             let asciiCandidate = utf8Bytes.allSatisfy { $0 < 0x80 } ? utf8Bytes : nil
+            let characterMask = FuzzyMatcher.characterMask(normalized)
             return Application(
                 name: application.name,
                 url: application.url,
                 id: "application:\(application.url.path)",
                 subtitle: application.url.deletingLastPathComponent().path,
                 normalizedName: normalized,
-                asciiCandidate: asciiCandidate
+                asciiCandidate: asciiCandidate,
+                characterMask: characterMask
             )
         }
     }
